
&НаКлиенте
Процедура Создать(Команда)
	СоздатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНаСервере()

	ГУИДУдОбъкта  = "<Объект не найден> (144:8103002590f4abe111e92373eba25499)";
	
	// ГУИДУдОбъкта =  <Объект не найден> (84:bf5600145e3710ab11dda4c605dbe824)
	ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъкта,"<Объект не найден> (","");
	ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,")","");
	ГУИДУдОбъктаСтр = СтрЗаменить(ГУИДУдОбъктаСтр,"0x","");
	ГУИДУдОбъктаСтр = Сред(ГУИДУдОбъктаСтр, Найти(ГУИДУдОбъктаСтр,":")+1, СтрДлина(ГУИДУдОбъктаСтр));
	// Преобразуем GUID
	ГУИД = Сред(ГУИДУдОбъктаСтр,25,8)+"-"+Сред(ГУИДУдОбъктаСтр,21,4)+"-"+Сред(ГУИДУдОбъктаСтр,17,4)+"-"+Сред(ГУИДУдОбъктаСтр,1,4)+"-"+Сред(ГУИДУдОбъктаСтр,5,12);			//и получаем ГУИД = 05dbe824-a4c6-11dd-bf56-00145e3710ab    
	
	
	
	РезСсылка = Справочники.ргПлощадки.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
    ОбъектПлощадки = РезСсылка.ПолучитьОбъект();
    НоваяПлощадка= Справочники.ргПлощадки.СоздатьЭлемент();
    Если ОбъектПлощадки  = Неопределено Тогда
        НоваяПлощадка.УстановитьСсылкуНового(РезСсылка);
	КонецЕсли;
	НоваяПлощадка.ОбменДанными.Загрузка=Истина;
    //НоваяПлощадка.Наименование = "";
    НоваяПлощадка.Записать();
	
КонецПроцедуры
